test/artilleryTeste/postTest.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 30
      arrivalRate: 15
  processor: './processor.js'

scenarios:
  - name: 'post payload'
    flow:
      - function: 'generateProductData'
      - post:
          url: '/product'
          json:
            'nome': '{{ nome }}'
            'valor': '{{ valor }}'
            'descrição': 'descrição produto'
      - log: 'produto {{nome}}'
#artillery run -o report.json test/artilleryTeste/postTest.yml
#artillery report -o report.html report.json;