test/artilleryTeste/postTest.yml
config:
  target: 'http://localhost:4000/'
  phases:
    - duration: 10
    - arrivalRate: 5
  processor: './processor.js'

scenarios:
  - name: 'post payload'
    flow:
      - post:
        url: '/products'
        beforeRequest: generateProductData
        json:
          nome: '{{ nome }}'
          valor: '{{ valor }}'
          descrição: '{{ descrição }}'
#artillery run test/artilleryTeste/postTest.yml